In [24]:
import pandas as pd
import numpy as np

In [25]:
inputs=pd.read_csv('titanic.csv')
inputs

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [26]:
inputs.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)
# removing the unnecessary features and keeping olny relevant features for prediction

In [27]:
inputs.head(10)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500
5         0       3    male   NaN   8.4583
6         0       1    male  54.0  51.8625
7         0       3    male   2.0  21.0750
8         1       3  female  27.0  11.1333
9         1       2  female  14.0  30.0708

In [29]:
inputs.isnull().values.any()

True

In [6]:
mean=inputs['Age'].median()
inputs['Age']=inputs['Age'].fillna(mean)
# inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [7]:
inputs.isnull().values.any()

False

In [30]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
inputs['Sex']=le.fit_transform(inputs['Sex'])
# OR
# inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})
# ML algorithm can be only trained on numeric values so converting alphabetic values into numeric value
# OR
# inputs['Sex'][inputs['Sex']=='male']=1
# inputs['Sex'][inputs['Sex']=='female']=0
# inputs.head()

inputs

     Survived  Pclass  Sex   Age     Fare
0           0       3    0  22.0   7.2500
1           1       1    1  38.0  71.2833
2           1       3    1  26.0   7.9250
3           1       1    1  35.0  53.1000
4           0       3    0  35.0   8.0500
..        ...     ...  ...   ...      ...
886         0       2    0  27.0  13.0000
887         1       1    1  19.0  30.0000
888         0       3    1   NaN  23.4500
889         1       1    0  26.0  30.0000
890         0       3    0  32.0   7.7500

[891 rows x 5 columns]

In [31]:
from sklearn.model_selection import train_test_split
X=inputs.iloc[:,1:]
# taking all the columns as feaures except first columns 'Survived'
y=inputs.iloc[:,0]
# var.iloc[start of row:end of row,start of column:end of columns]
# assigning the survived columns to y

In [32]:
X.head()
# input

   Pclass  Sex   Age     Fare
0       3    0  22.0   7.2500
1       1    1  38.0  71.2833
2       3    1  26.0   7.9250
3       1    1  35.0  53.1000
4       3    0  35.0   8.0500

In [11]:
y.head()
# output

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [12]:

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=10)

In [13]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [14]:
inputs.isnull().values.any()
# checking if tthere is any null value the dataframe

False

In [15]:
n1=len(X_train)
n2=len(X_test)
print('[INFO]Training example={}\n[INFO]Testing example={}'.format(n1,n2))

[INFO]Training example=712
[INFO]Testing example=179

In [16]:
model.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [20]:
model.feature_importances_
# show the importance of each training features

array([0.12260091, 0.29382004, 0.24709094, 0.33648811])

In [17]:
model.score(X_test,y_test)

0.8212290502793296

In [149]:
r=model.predict([[3,1,22.000000,7.2500]])
if (r==1):
    print('[INFO] Passenger Survived')
else:
    print('[INFO] Passenger did not Survived')

# predicting whether a passeneger survived or not

[INFO] Passenger did not Survived

# To understang:Difference between gini impurity and entropy?